package hw.hw1;

public class HW1_task1 {
    /*
     * --------------------------------------------------------------------------------------
     * Задача №1
     * --------------------------------------------------------------------------------------
     * Написать программу которая будет печатать/выводить следующий текст:
     * 3
     * 2
     * 1
     * Поехали!!!
     */
    public static void main(String[] args) {

        System.out.println(
                "3\n"
                        + "2\n"
                        + "1\n"
                        + "Поехали!!!"
        );
    }

}