package hw.hw3;

public class HW3_task1 {

    public static void main(String[] args) {

        /*
         * --------------------------------------------------------------------------------------
         * Задача №1
         * --------------------------------------------------------------------------------------
         * Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным
         * на ваш выбор и вывести следующие строки:
         * a == b - если переменные равны
         * a < b - если переменная a меньше b
         * a > b - если переменная b меньше a
         */


        int a = 41;
        int b = 20;

        if (a == b){
            System.out.println("Переменые равны");
        } else if (a < b) {
            System.out.println("Переменная a < b");
        } else if (a > b) {
            System.out.println("Переменная a > b");
        } else {
            System.out.println("Error");
        }

        // fori

        }
    }


