package hw.hw6.hw6_part2;

public class HW6_part2_task2 {

    /*
     * * --------------------------------------------------------------------------------------
     * Задача №2
     * --------------------------------------------------------------------------------------
     * Дана строка:
     * String s = “Перевыборы выбранного президента”;
     * необходимо подсчитать количество букв “е” в строке.
     * Для указанной строки ответ будет 4.
     */

    public static void main(String[] args) {

        String s1 = "Перевыборы выбранного президента";
        int count = 0;
        for (int i = 0; i < s1.length(); i++) {
            if (s1.charAt(i) == 'е'){
                count++;
            }
        }
        System.out.println(count);
    }
}
