package hw.hw6.hw6_part2;

public class HW6_part2_task2 {

    /*
     * * --------------------------------------------------------------------------------------
     * Задача №2
     * --------------------------------------------------------------------------------------
     * Дана строка:
     * String s = “Перевыборы выбранного президента”;
     * необходимо подсчитать количество букв “е” в строке.
     * Для указанной строки ответ будет 4.
     */

    public static void main(String[] args) {

        String s1 = "Перевыборы выбранного президента";
        int count = 0;
        for (int i = 0; i < s1.length(); i++) {
            if (s1.charAt(i) == 'е'){
                count++;
            }
        }
        System.out.println(count);


        s1 = "Перевыборы выбранного президента";

        int index = s1.indexOf("е");
        int j = 0;
        int i = 0;
        while ( i<s1.length() && i != -1) {
            index = s1.indexOf("е", index+1);
            i = index;
            j++;
        }

        System.out.println("Символ Е встречается " + j + " раз");


    }


}
