package hw.hw4;

public class HW4_task1 {

    public static void main(String[] args) {

        /*
         * --------------------------------------------------------------------------------------
         * Задача №1
         * --------------------------------------------------------------------------------------
         * Необходимо вывести числа от 0 до 15.
         */

        // task1

//        for (int i = 0; i <= 15; i++) {
//
//            System.out.println(i);
//
//        }








    }

}
