package hw.hw7;

public class Person {

       /*
         * --------------------------------------------------------------------------------------
         * Задача №1
         * --------------------------------------------------------------------------------------
         * Необходимо создать класс Person с полями: имя, возраст, пол.
         * Класс должен иметь метод - getName, метод возвращает имя с префиксом
         * “Mr. ” если пол указан как мужской и префикс
         * “Mrs. ” если женский.
         */

    String name;
    int age;
    String gender;


    String getName(){
        if ( gender == "female"){
            return "Mrs. " + name;
        } else if (gender == "male"){
            return "Mr. " + name;
        } else {
            return "Error ";
        }
    }





}
